# ~/Brewfile

# ====================
# Taps
# ====================
tap "homebrew/cask-fonts"
tap "homebrew/services"

# ====================
# CLI Tools - Essential
# ====================
brew "git"              # Version control
brew "zsh"              # Shell
brew "curl"             # Transfer data
brew "wget"             # Download utility
brew "openssl@3"

# ====================
# CLI Tools - Development
# ====================
brew "node"             # JavaScript runtime
brew "python@3.11"      # Python interpreter
brew "go"               # Go programming language
brew "rust"             # Rust programming language
brew "ruby"
brew "openjdk@11"
brew "mariadb"
brew "postgresql@15"
brew "redis"
brew "uv"

# ====================
# CLI Tools - Utilities
# ====================
brew "tmux"             # Terminal multiplexer
brew "htop"             # Process viewer
brew "tree"             # Directory visualizer
brew "jq"               # JSON processor
brew "bat"              # Cat with syntax highlighting
brew "fzf"              # Fuzzy finder
brew "aws-c-s3"
brew "awscli"
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"

# ====================
# Editors
# ====================
brew "neovim"           # Modern Vim
brew "vim"              # Classic editor

# ====================
# Applications - Development
# ====================
cask "pycharm"
cask "clion"
cask "intellij-idea"
cask "visual-studio-code"     # Code editor
cask "docker"                  # Containers
cask "postman"                 # API testing
cask "claude-code"
cask "mactex-no-gui"
cask "pearcleaner"
cask "termius"
cask "warp"
cask "zulu@8"

# ====================
# Applications - Productivity
# ====================
cask "google-chrome"           # Web browser
cask "slack"                   # Communication
cask "notion"                  # Notes
cask "notion-calendar"
cask "notion-mail"
cask "easydict"
cask "raycast"
cask "anki"
cask "comet"
cask "ogdesign-eagle"
cask "google-drive"
cask "maczip"
cask "spotify"
cask "telegram"
cask "iina"
cask "zotero"
cask "snipaste"
cask "simpletex"

# CN
cask "baidunetdisk"
cask "wechat"
cask "updf"
cask "wpsoffice"

# ====================
# Applications - Utilities
# ====================
cask "rectangle"               # Window manager
cask "stats"                   # System monitor
cask "alt-tab"                 # Better app switching

# ====================
# Fonts
# ====================
cask "font-fira-code"          # Programming font
cask "font-jetbrains-mono"     # Programming font

# ====================
# Mac App Store
# ====================
brew "mas"
mas "Xcode", id: 497799835
mas "Things 3", id: 904280696

