# ~/Brewfile

# ====================
# Taps
# ====================
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "leonwong282/tap"           # Personal tap for specific formulas
tap "stripe/stripe-cli"         # Official Stripe CLI repository

# ====================
# CLI Tools - Essential
# ====================
brew "git"              # Version control
brew "gh"
brew "zsh"              # Shell
brew "curl"             # Transfer data
brew "wget"             # Download utility
brew "chezmoi"          # Manage your dotfiles across multiple machines

# ====================
# CLI Tools - Development
# ====================
brew "node"             # JavaScript runtime
brew "python@3.12"      # Python interpreter
brew "go"               # Go programming language
brew "rust"             # Rust programming language
brew "uv"               # Extremely fast Python package and project manager
brew "openjdk@11"       # Java Development Kit (LTS version)
brew "rbenv"            # Ruby version manager
brew "cocoapods"        # Dependency manager for Swift and Objective-C
brew "awscli"           # Universal Command Line Interface for AWS
brew "cloudflare-wrangler"   # CLI tool for Cloudflare Workers development
brew "vercel-cli"       # Command-line interface for Vercel platform
brew "docker"           # Lightweight container
brew "qt"               # Cross-platform application development framework
brew "gemini-cli"       # CLI tool for interacting with Google Gemini AI
brew "stripe/stripe-cli/stripe" # Official Stripe CLI tool for payment integration
brew "postgresql@15", restart_service: :changed
brew "mariadb"         
brew "redis", restart_service: :changed

# ====================
# CLI Tools - Utilities
# ====================
brew "htop"             # Process viewer
brew "tree"             # Directory visualizer
brew "jq"               # JSON processor
brew "bat"              # Cat with syntax highlighting
brew "eza"              # A modern, feature-rich replacement for 'ls'
brew "fd"               # A fast and user-friendly alternative to 'find'
brew "fzf"              # Fuzzy finder
brew "ripgrep"          # ripgrep: fast grep
brew "genact"           # A nonsense activity generator (pretend to be busy)
brew "yt-dlp"

# ====================
# Editors
# ====================
brew "neovim"           # Modern Vim
brew "vim"              # Classic editor

# ====================
# Applications - Development
# ====================
cask "visual-studio-code"     # Code editor
cask "antigravity"
cask "pycharm"
cask "clion"
cask "claude-code"
cask "codex-app"
cask "warp"                   # Terminal emulator
cask "termius"
cask "mactex-no-gui"
cask "qt-creator"

# ====================
# Applications - Productivity
# ====================
cask "google-chrome"           # Web browser
cask "comet"
cask "thebrowsercompany-dia"   # Now part of Atlassian ecosystem
cask "chatgpt-atlas"
cask "slack"                   # Communication
cask "notion"                  # Notes
cask "chatgpt"
cask "google-gemini"
cask "claude"

# ====================
# Applications - Utilities
# ====================
cask "stats"                   # System monitor
cask "alt-tab"                 # Better app switching
cask "spotify"
cask "snipaste"
cask "ogdesign-eagle"
cask "clash-verge-rev"
cask "easydict"
cask "pearcleaner"

# ====================
# Fonts
# ====================
cask "font-fira-code"          # Programming font
cask "font-jetbrains-mono"     # Programming font

# ====================
# Mac App Store
# ====================
mas "Xcode", id: 497799835